{
  "_name_or_path": "facebook/convnext-large-384-22k-1k",
  "architectures": [
    "ConvNextForImageClassification"
  ],
  "depths": [
    3,
    3,
    27,
    3
  ],
  "drop_path_rate": 0.0,
  "hidden_act": "gelu",
  "hidden_sizes": [
    192,
    384,
    768,
    1536
  ],
  "id2label": {
    "0": "spaghetti",
    "1": "ramen",
    "2": "udon"
  },
  "image_size": 384,
  "initializer_range": 0.02,
  "label2id": {
    "ramen": 1,
    "spaghetti": 0,
    "udon": 2
  },
  "layer_norm_eps": 1e-12,
  "layer_scale_init_value": 1e-06,
  "model_type": "convnext",
  "num_channels": 3,
  "num_stages": 4,
  "out_features": [
    "stage4"
  ],
  "out_indices": [
    4
  ],
  "patch_size": 4,
  "stage_names": [
    "stem",
    "stage1",
    "stage2",
    "stage3",
    "stage4"
  ],
  "torch_dtype": "float32",
  "transformers_version": "4.47.1"
}
